{"modelTopology":{"class_name":"Model","config":{"name":"model5","layers":[{"name":"inputA","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"inputA"},"inbound_nodes":[]},{"name":"inputB","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"inputB"},"inbound_nodes":[]},{"name":"embedding_Embedding5","class_name":"Embedding","config":{"input_dim":4,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding5","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["inputA",0,0,{}]],[["inputB",0,0,{}]]]},{"name":"dot_Dot5","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_Dot5","trainable":true},"inbound_nodes":[[["embedding_Embedding5",0,0,{}],["embedding_Embedding5",1,0,{}]]]},{"name":"flatten_Flatten5","class_name":"Flatten","config":{"name":"flatten_Flatten5","trainable":true},"inbound_nodes":[[["dot_Dot5",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["flatten_Flatten5",0,0,{}]]]}],"input_layers":[["inputA",0,0],["inputB",0,0]],"output_layers":[["dense_Dense5",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding5/embeddings","shape":[4,64],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}